# St7GetSolverNumCPU

Returns the number of threads to use for solvers that support parallelisation.

long St7GetSolverNumCPU(long uID, long* NumCPU)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
NumCPU
Number of threads to use.